const products = [
    {
        "variants":  [
                         {
                             "price":  6500,
                             "name":  "عربي محلي — 1 كجم — مجبوس"
                         },
                         {
                             "price":  6500,
                             "name":  "عربي محلي — 1 كجم — مرق"
                         },
                         {
                             "price":  12750,
                             "name":  "عربي محلي — كامل — بدون تقطيع"
                         },
                         {
                             "price":  5500,
                             "name":  "شفالي — 1 كجم — مجبوس"
                         },
                         {
                             "price":  5500,
                             "name":  "شفالي — 1 كجم — مرق"
                         },
                         {
                             "price":  10900,
                             "name":  "شفالي — كامل — بدون تقطيع"
                         },
                         {
                             "price":  5000,
                             "name":  "أسترالي مبرد — 1 كجم — مجبوس"
                         },
                         {
                             "price":  5000,
                             "name":  "أسترالي مبرد — 1 كجم — مرق"
                         },
                         {
                             "price":  10000,
                             "name":  "أسترالي مبرد — كامل — بدون تقطيع"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري — 1 كجم — مجبوس"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري — 1 كجم — مرق"
                         },
                         {
                             "price":  11900,
                             "name":  "عربي سوري — كامل — بدون تقطيع"
                         }
                     ],
        "oldPrice":  null,
        "name":  "كتف خروف",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/s-34224_0fc140d9-ec12-428c-ab32-c159eae60fef.jpg?v=1744405544",
        "image":  "assets/product-0.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  2250,
                             "name":  "عجل محلي / ناعم / نصف كيلو"
                         },
                         {
                             "price":  4500,
                             "name":  "عجل محلي / ناعم / واحد كيلو"
                         },
                         {
                             "price":  2250,
                             "name":  "عجل محلي / خشن / نصف كيلو"
                         },
                         {
                             "price":  4500,
                             "name":  "عجل محلي / خشن / واحد كيلو"
                         },
                         {
                             "price":  2250,
                             "name":  "عجل محلي / وسط / نصف كيلو"
                         },
                         {
                             "price":  4500,
                             "name":  "عجل محلي / وسط / واحد كيلو"
                         },
                         {
                             "price":  3250,
                             "name":  "خروف عربي محلي / ناعم / نصف كيلو"
                         },
                         {
                             "price":  6500,
                             "name":  "خروف عربي محلي / ناعم / واحد كيلو"
                         },
                         {
                             "price":  3250,
                             "name":  "خروف عربي محلي / خشن / نصف كيلو"
                         },
                         {
                             "price":  6500,
                             "name":  "خروف عربي محلي / خشن / واحد كيلو"
                         },
                         {
                             "price":  3250,
                             "name":  "خروف عربي محلي / وسط / نصف كيلو"
                         },
                         {
                             "price":  6500,
                             "name":  "خروف عربي محلي / وسط / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف شفالي / ناعم / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف شفالي / ناعم / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف شفالي / خشن / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف شفالي / خشن / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف شفالي / وسط / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف شفالي / وسط / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف أسترالي مبرد / ناعم / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف أسترالي مبرد / ناعم / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف أسترالي مبرد / خشن / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف أسترالي مبرد / خشن / واحد كيلو"
                         },
                         {
                             "price":  2750,
                             "name":  "خروف أسترالي مبرد / وسط / نصف كيلو"
                         },
                         {
                             "price":  5500,
                             "name":  "خروف أسترالي مبرد / وسط / واحد كيلو"
                         },
                         {
                             "price":  3000,
                             "name":  "عربي سوري / ناعم / نصف كيلو"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري / ناعم / واحد كيلو"
                         },
                         {
                             "price":  3000,
                             "name":  "عربي سوري / خشن / نصف كيلو"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري / خشن / واحد كيلو"
                         },
                         {
                             "price":  3000,
                             "name":  "عربي سوري / وسط / نصف كيلو"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري / وسط / واحد كيلو"
                         }
                     ],
        "oldPrice":  null,
        "name":  "مفروم لحم",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/mafroum-lahm-1600.jpg?v=1787054201",
        "image":  "assets/product-1.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  6000,
                             "name":  "عربي محلي — 1 كجم — مجبوس"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي محلي — 1 كجم — مرق"
                         },
                         {
                             "price":  8750,
                             "name":  "عربي محلي — كامل — بدون تقطيع"
                         },
                         {
                             "price":  5500,
                             "name":  "عربي سوري — 1 كجم — مجبوس"
                         },
                         {
                             "price":  5500,
                             "name":  "عربي سوري — 1 كجم — مرق"
                         },
                         {
                             "price":  8250,
                             "name":  "عربي سوري — كامل — بدون تقطيع"
                         },
                         {
                             "price":  5000,
                             "name":  "شفالي — 1 كجم — مجبوس"
                         },
                         {
                             "price":  5000,
                             "name":  "شفالي — 1 كجم — مرق"
                         },
                         {
                             "price":  7500,
                             "name":  "شفالي — كامل — بدون تقطيع"
                         },
                         {
                             "price":  5000,
                             "name":  "أسترالي مبرد — 1 كجم — مجبوس"
                         },
                         {
                             "price":  5000,
                             "name":  "أسترالي مبرد — 1 كجم — مرق"
                         },
                         {
                             "price":  7500,
                             "name":  "أسترالي مبرد — كامل — بدون تقطيع"
                         }
                     ],
        "oldPrice":  null,
        "name":  "رقبة خروف",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/s-34214.jpg?v=1742425687",
        "image":  "assets/product-2.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  6500,
                             "name":  "عربي محلي — 1 كجم — مقطع"
                         },
                         {
                             "price":  3250,
                             "name":  "عربي محلي — حبة كاملة"
                         },
                         {
                             "price":  6000,
                             "name":  "عربي سوري — 1 كجم — مقطع"
                         },
                         {
                             "price":  5500,
                             "name":  "شفالي — 1 كجم — مقطع"
                         },
                         {
                             "price":  3000,
                             "name":  "عربي سوري — حبة كاملة"
                         }
                     ],
        "oldPrice":  null,
        "name":  "موزات خروف",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/mozat-kharouf-1600.jpg?v=1787054203",
        "image":  "assets/product-3.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  3500,
                             "name":  "للشوي / ماعون 6قطع"
                         },
                         {
                             "price":  6500,
                             "name":  "للشوي / 12 قطعة"
                         },
                         {
                             "price":  3500,
                             "name":  "من غير تتبيلة / ماعون 6قطع"
                         },
                         {
                             "price":  6500,
                             "name":  "من غير تتبيلة / 12 قطعة"
                         },
                         {
                             "price":  3500,
                             "name":  "للطبخ / ماعون 6قطع"
                         },
                         {
                             "price":  6500,
                             "name":  "للطبخ / 12 قطعة"
                         }
                     ],
        "oldPrice":  null,
        "name":  "ريش خروف",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/reesh-kharouf-1600.jpg?v=1787054202",
        "image":  "assets/product-4.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  4000,
                             "name":  "شوي / 1 كجم / تتبيلة شوي"
                         },
                         {
                             "price":  4000,
                             "name":  "شوي / 1 كجم / تتبيلة حمسة"
                         },
                         {
                             "price":  4000,
                             "name":  "حمسة / 1 كجم / تتبيلة شوي"
                         },
                         {
                             "price":  4000,
                             "name":  "حمسة / 1 كجم / تتبيلة حمسة"
                         },
                         {
                             "price":  4000,
                             "name":  "بدون تقطيع / 1 كجم / تتبيلة شوي"
                         },
                         {
                             "price":  4000,
                             "name":  "بدون تقطيع / 1 كجم / تتبيلة حمسة"
                         }
                     ],
        "oldPrice":  null,
        "name":  "كبدة خروف",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/kibda-kharouf-1600.jpg?v=1787058360",
        "image":  "assets/product-5.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  18900,
                             "name":  "بوكس 24 قطعة"
                         }
                     ],
        "oldPrice":  23000,
        "name":  "بوكس برجر مكس لحم ودجاج (24 قطعة)",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/21.png?v=1745705195",
        "image":  "assets/product-6.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  20900,
                             "name":  "بوكس 24 قطعة"
                         }
                     ],
        "oldPrice":  24000,
        "name":  "بوكس برجر لحم بالجبن (24 قطعة)",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/31_3daee615-5340-4867-8f61-4593d32df7ef.png?v=1745706151",
        "image":  "assets/product-7.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  35000,
                             "name":  "40 + 10 وجبات مجانًا"
                         },
                         {
                             "price":  42000,
                             "name":  "50 + 10 وجبات مجانًا"
                         },
                         {
                             "price":  68000,
                             "name":  "90 + 10 وجبات مجانًا"
                         },
                         {
                             "price":  22000,
                             "name":  "25 وجبة"
                         }
                     ],
        "oldPrice":  null,
        "name":  "بوكس وجبات دايت",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/freepik__retouch__25484.png?v=1759907161",
        "image":  "assets/product-8.jpg"
    },
    {
        "variants":  [
                         {
                             "price":  99000,
                             "name":  "مجبوس"
                         },
                         {
                             "price":  99000,
                             "name":  "مرق"
                         },
                         {
                             "price":  99000,
                             "name":  "نصف مجبوس ونصف مرق"
                         },
                         {
                             "price":  120000,
                             "name":  "مفطح الفخذين مع اللية وكل يد وجبن مع بعض منفصلين وكل نصف رقبة مع يد وجنب"
                         }
                     ],
        "oldPrice":  null,
        "name":  "ذبيحة خروف عربي سوري 3–4 أشهر (14–16 كجم)",
        "remote":  "https://cdn.shopify.com/s/files/1/0929/0534/1206/files/0_b0c5fd5c-57c9-4063-a791-d6b836262602.png?v=1746740827",
        "image":  "assets/product-9.jpg"
    }
];